// ignore: camel_case_types
class TermsOfService {
  String termsText = '''この利用規約（以下，「本規約」といいます。）は，菊地祐希（以下，「甲」といいます。）がこのアプリ上で提供するサービス（以下，「本サービス」といいます。）の利用条件を定めるものです。登録ユーザーの皆さま（以下，「乙」といいます。）には，本規約に従って，本サービスをご利用いただきます。

第1条（適用）
本規約は，本サービスの利用に関わる一切の関係に適用されるものとします。
本サービスに関し，本規約のほか，ご利用にあたってのルール等，各種の定め（以下，「個別規定」といいます。）をすることがあります。これら個別規定はその名称のいかんに関わらず，本規約の一部を構成するものとします。
本規約の規定が前条の個別規定の規定と矛盾する場合には，個別規定において特段の定めなき限り，個別規定の規定が優先されるものとします。

第2条（禁止事項）
甲は、本サービスの提供の停止または中断により，乙または第三者が被ったいかなる不利益または損害についても，一切の責任を負わないものとします。

第3条（保証の否認および免責事項）
甲は，本サービスに事実上または法律上の瑕疵（安全性，信頼性，正確性，完全性，有効性，特定の目的への適合性，セキュリティなどに関する欠陥，エラーやバグ，権利侵害などを含みます。）がないことを明示的にも黙示的にも保証しておりません。
甲は，本サービスに起因して乙に生じたあらゆる損害について、当社の故意又は重過失による場合を除き、一切の責任を負いません。
前項ただし書に定める場合であっても，甲は，甲の過失による債務不履行または不法行為により乙に生じた損害のうち特別な事情から生じた損害（甲または乙が損害発生につき予見し，または予見し得た場合を含みます。）について一切の責任を負いません。
甲は，本サービスに関して，乙と他の乙または第三者との間において生じた取引，連絡または紛争等について一切責任を負いません。

第4条（サービス内容の変更等）
甲は，乙への事前の告知をもって、本サービスの内容を変更、追加または廃止することがあり、乙はこれを承諾するものとします。

第5条（利用規約の変更）
甲は以下の場合には、乙の個別の同意を要せず、本規約を変更することができるものとします。
本規約の変更が乙の一般の利益に適合するとき。
本規約の変更が本サービス利用契約の目的に反せず、かつ、変更の必要性、変更後の内容の相当性その他の変更に係る事情に照らして合理的なものであるとき。
甲は乙に対し、前項による本規約の変更にあたり、事前に、本規約を変更する旨及び変更後の本規約の内容並びにその効力発生時期を通知します。

第6条（個人情報の取扱い）
甲は，本サービスの利用によって取得する個人情報については，「プライバシーポリシー」に従い適切に取り扱うものとします。

第7条（権利義務の譲渡の禁止）
乙は，甲の書面による事前の承諾なく，利用契約上の地位または本規約に基づく権利もしくは義務を第三者に譲渡し，または担保に供することはできません。

第8条（準拠法）
本規約の解釈にあたっては，日本法を準拠法とします。
以上''';
}
